In [62]:
import json
import numpy as np
import pandas as pd
import sys
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all" 
pd.set_option('display.max_colwidth', 300)
sys.path.append("../")
%load_ext autoreload
%autoreload 2
from core.utils import load_json_file, load_jsonl_file

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [77]:
input_file = '../data/CSpider/train.json'
batch = load_json_file(input_file)
len(batch)

load json file from ../data/CSpider/train.json

8659

In [6]:
input_file = '../data/CSpider/dev.json'
batch = load_json_file(input_file)
len(batch)

load json file from ../data/CSpider/dev.json

1034

In [12]:
df = pd.DataFrame(batch)
df.sample(3)

,db_id,query_toks_no_value,question_toks,query_toks,question,sql,query
653,poker_player,"[select, avg, (, earnings, ), from, poker_player]","[扑, 克, 玩, 家, 的, 平, 均, 收, 入, 是, 多, 少, ？]","[select, avg, (, earnings, ), from, poker_player]",扑克玩家的平均收入是多少？,"{'orderBy': [], 'from': {'table_units': [['tab...",SELECT avg(Earnings) FROM poker_player
413,museum_visit,"[select, avg, (, age, ), from, visitor, where,...","[会, 员, 级, 别, 不, 高, 于, 4, 的, 游, 客, 的, 平, 均, 年, ...","[select, avg, (, age, ), from, visitor, where,...",会员级别不高于4的游客的平均年龄是多少？,"{'orderBy': [], 'from': {'table_units': [['tab...",SELECT avg(age) FROM visitor WHERE Level_of_me...
160,car_1,"[select, count, (, *, ), from, cars_data, wher...","[加, 速, 度, 比, 马, 力, 最, 大, 的, 汽, 车, 更, 大, 的, 汽, ...","[select, count, (, *, ), from, cars_data, wher...",加速度比马力最大的汽车更大的汽车有多少辆？,"{'orderBy': [], 'from': {'table_units': [['tab...",SELECT COUNT(*) FROM CARS_DATA WHERE Accelerat...

In [21]:
i = 200
print(''.join(df.loc[i,'question_toks']))
print(' '.join(df.loc[i,'query_toks']))
# print(df.loc[i,'sql'])

返回代号为“AKO”的机场名称。
select airportname from airports where airportcode = "AKO"

## 推理结果

In [53]:
input_file = '../outputs/Cspider/output_spider.json'
batch = load_jsonl_file(input_file)
df = pd.DataFrame(batch)
len(batch)

load jsonl file from ../outputs/Cspider/output_spider.json

345

In [76]:
# with open('../outputs/Cspider_pred_all/output.json', 'w') as file:
#     for item in df['pred'].str.replace('\n', ' '):
#         a = file.write("%s\n" % item)

In [70]:
df[['db_id','query', 'qa_pairs', 'pred']].head(10)

,db_id,query,qa_pairs,pred
0,concert_singer,我们有多少歌手？,```sql\nSELECT COUNT(*) FROM singer\n```,SELECT COUNT(*) FROM singer
1,concert_singer,歌手的总数是多少？,```sql\nSELECT COUNT(*) FROM singer\n```,SELECT COUNT(*) FROM singer
2,concert_singer,按歌手年龄从最大到最小，显示每个歌手的姓名、国家、年龄。,"```sql\nSELECT `Name`, `Country`, `Age` FROM singer ORDER BY `Age` DESC\n```","SELECT `Name`, `Country`, `Age` FROM singer ORDER BY `Age` DESC"
3,concert_singer,按年龄降序，每个歌手的名字、国家、年龄是什么？,"```sql\nSELECT `Name`, `Country`, `Age` FROM singer ORDER BY `Age` DESC\n```","SELECT `Name`, `Country`, `Age` FROM singer ORDER BY `Age` DESC"
4,concert_singer,法国所有歌手的平均年龄、最小年龄和最大年龄是多少？,"```sql\nSELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'France'\n```","SELECT AVG(Age), MIN(Age), MAX(Age) FROM singer WHERE Country = 'France'"
5,concert_singer,所有法国歌手的平均年龄、最小年龄和最大年龄是多少？,"```sql\nSELECT \n AVG(Age) AS ""Average Age"",\n MIN(Age) AS ""Minimum Age"",\n MAX(Age) AS ""Maximum Age""\nFROM singer\nWHERE Country = 'France'\n```","SELECT \n AVG(Age) AS ""Average Age"",\n MIN(Age) AS ""Minimum Age"",\n MAX(Age) AS ""Maximum Age""\nFROM singer\nWHERE Country = 'France'"
6,concert_singer,显示最年轻歌手的歌曲的名字和发行年份。,"```sql\nSELECT `Song_Name`, `Song_release_year` FROM singer WHERE Age = (SELECT MIN(Age) FROM singer)\n```","SELECT `Song_Name`, `Song_release_year` FROM singer WHERE Age = (SELECT MIN(Age) FROM singer)"
7,concert_singer,最年轻歌手的所有歌曲的名字和发行年是多少？,"```sql\nSELECT `Song_Name`, `Song_release_year` \nFROM singer \nWHERE Age = (SELECT MIN(Age) FROM singer)\n```","SELECT `Song_Name`, `Song_release_year` \nFROM singer \nWHERE Age = (SELECT MIN(Age) FROM singer)"
8,concert_singer,20岁以上的歌手来自哪些不同国家？,```sql\nSELECT DISTINCT(`Country`) FROM singer WHERE `Age` > 20\n```,SELECT DISTINCT(`Country`) FROM singer WHERE `Age` > 20
9,concert_singer,哪些国家有20岁以上的歌手？,```sql\nSELECT DISTINCT `Country` FROM singer WHERE Age > 20\n```,SELECT DISTINCT `Country` FROM singer WHERE Age > 20